testEdo/3D/combustorRhoPimpleMidday/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoPimpleFoam;

startFrom       latestTime;

startTime       0;

deltaT		1e-5;

stopAt          endTime;

endTime         0.05;

adjustTimeStep	yes;

maxCo		50;

writeControl    adjustableRunTime;

writeInterval   0.01;

purgeWrite      0;

writeFormat     binary;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
	#includeFunc	residuals(p,U,k,epsilon,h)
	#includeFunc 	flowRatePatch(name=outlet)
	#include	"functionObjects/fieldAverage.cpp"
	#include 	"functionObjects/forces.cpp"
	#include	"functionObjects/machNumber.cpp"
	#include	"functionObjects/pressure.cpp"
	#include	"functionObjects/temperature.cpp"
	#include	"functionObjects/yPlus.cpp"
	#include	"functionObjects/courant.cpp"
}

// Add libraries compiled by the user
libs
(
 	"searchableCone.so"
);
