testEdo/3D/combustorRhoPimpleMidday/0/N2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    object      N2;
}
// ************************************************************************* //

dimensions          [0 0 0 0 0 0 0];

internalField       uniform 0.767;

boundaryField
{
    wall
    {
        type                zeroGradient;
    }
    outlet
    {
        type                zeroGradient;
    }
    inlet
    {
        type                fixedValue;
        value               $internalField;
    }

}

// ************************************************************************* //
